#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/aws-databricks-main/runs/run-rRXpCsAjJyQDdGgu

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_s3_bucket.root_bucket will be created
  + resource "aws_s3_bucket" "root_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "honest-rootbucket"
        }
      + tags_all                    = {
          + "Name" = "honest-rootbucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "aws:kms"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # random_string.naming will be created
  + resource "random_string" "naming" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.aws-databricks.data.databricks_aws_bucket_policy.this will be read during apply
  # (config refers to values not yet known)
 <= data "databricks_aws_bucket_policy" "this"  {
      + bucket = (known after apply)
      + id     = (known after apply)
      + json   = (known after apply)
    }

  # module.aws-databricks.aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "honest-databricks-nat"
        }
      + tags_all             = {
          + "Name" = "honest-databricks-nat"
        }
      + vpc                  = true
    }

  # module.aws-databricks.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "honest-databricks-igw"
        }
      + tags_all = {
          + "Name" = "honest-databricks-igw"
        }
      + vpc_id   = "random_id"
    }

  # module.aws-databricks.aws_nat_gateway.gateway will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "random_id"
      + tags                 = {
          + "Name" = "honest-databricks-nat"
        }
      + tags_all             = {
          + "Name" = "honest-databricks-nat"
        }
    }

  # module.aws-databricks.aws_route.private_nat_gateway will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.aws-databricks.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.aws-databricks.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "honest-databricks-private"
        }
      + tags_all         = {
          + "Name" = "honest-databricks-private"
        }
      + vpc_id           = "random_id"
    }

  # module.aws-databricks.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "honest-databricks-public"
        }
      + tags_all         = {
          + "Name" = "honest-databricks-public"
        }
      + vpc_id           = "random_id"
    }

  # module.aws-databricks.aws_route_table_association.private["random_id"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "random_id"
    }

  # module.aws-databricks.aws_route_table_association.private["random_id_2"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "random_id_2"
    }

  # module.aws-databricks.aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "random_id"
    }

  # module.aws-databricks.aws_s3_bucket_policy.root_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "root_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.aws-databricks.aws_s3_bucket_public_access_block.root_storage_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "root_storage_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.aws-databricks.aws_security_group.databricks_sg will be created
  + resource "aws_security_group" "databricks_sg" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow all internal TCP and UDP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "honest-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_tls"
        }
      + tags_all               = {
          + "Name" = "allow_tls"
        }
      + vpc_id                 = "random_id"
    }

  # module.aws-databricks.databricks_mws_credentials.creds will be created
  + resource "databricks_mws_credentials" "creds" {
      + account_id       = (sensitive value)
      + creation_time    = (known after apply)
      + credentials_id   = (known after apply)
      + credentials_name = "honest-creds"
      + external_id      = (known after apply)
      + id               = (known after apply)
      + role_arn         = "arn:aws:iam::509042517039:role/honest-crossaccount"
    }

  # module.aws-databricks.databricks_mws_networks.vpc_network will be created
  + resource "databricks_mws_networks" "vpc_network" {
      + account_id         = (sensitive value)
      + creation_time      = (known after apply)
      + id                 = (known after apply)
      + network_id         = (known after apply)
      + network_name       = "honest-network"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "random_id",
          + "random_id_2",
        ]
      + vpc_id             = "random_id"
      + vpc_status         = (known after apply)
      + workspace_id       = (known after apply)

      + error_messages {
          + error_message = (known after apply)
          + error_type    = (known after apply)
        }

      + vpc_endpoints {
          + dataplane_relay = (known after apply)
          + rest_api        = (known after apply)
        }
    }

  # module.aws-databricks.databricks_mws_storage_configurations.root_storage will be created
  + resource "databricks_mws_storage_configurations" "root_storage" {
      + account_id                 = (sensitive value)
      + bucket_name                = (known after apply)
      + creation_time              = (known after apply)
      + id                         = (known after apply)
      + storage_configuration_id   = (known after apply)
      + storage_configuration_name = "honest-storage"
    }

  # module.aws-databricks.databricks_mws_workspaces.workspace will be created
  + resource "databricks_mws_workspaces" "workspace" {
      + account_id               = (sensitive value)
      + aws_region               = "ap-southeast-1"
      + cloud                    = (known after apply)
      + creation_time            = (known after apply)
      + credentials_id           = (known after apply)
      + deployment_name          = "honest-deployment"
      + id                       = (known after apply)
      + is_no_public_ip_enabled  = true
      + network_id               = (known after apply)
      + pricing_tier             = (known after apply)
      + storage_configuration_id = (known after apply)
      + workspace_id             = (known after apply)
      + workspace_name           = "honest-test-lab-networking"
      + workspace_status         = (known after apply)
      + workspace_status_message = (known after apply)
      + workspace_url            = (known after apply)

      + token {
          + comment          = "Terraform"
          + lifetime_seconds = 2592000
          + token_id         = (known after apply)
          + token_value      = (sensitive value)
        }
    }

  # module.aws-databricks.null_resource.previous will be created
  + resource "null_resource" "previous" {
      + id = (known after apply)
    }

  # module.aws-databricks.random_string.naming will be created
  + resource "random_string" "naming" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.aws-databricks.time_sleep.wait will be created
  + resource "time_sleep" "wait" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.databricks_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Databricks policy"
      + id          = (known after apply)
      + name        = "honest-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:TerminateInstances",
                          + "ec2:RunInstances",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupEgress",
                          + "ec2:RequestSpotInstances",
                          + "ec2:ReplaceIamInstanceProfileAssociation",
                          + "ec2:DisassociateIamInstanceProfile",
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcAttribute",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSpotPriceHistory",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeReservedInstancesOfferings",
                          + "ec2:DescribePrefixLists",
                          + "ec2:DescribeNetworkAcls",
                          + "ec2:DescribeNatGateways",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:DescribeIamInstanceProfileAssociations",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteVolume",
                          + "ec2:DeleteTags",
                          + "ec2:CreateVolume",
                          + "ec2:CreateTags",
                          + "ec2:CancelSpotInstanceRequests",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupEgress",
                          + "ec2:AttachVolume",
                          + "ec2:AssociateIamInstanceProfile",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "iam:PutRolePolicy",
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringLike = {
                              + iam:AWSServiceName = "ec2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::*:role/aws-service-role/spot.amazonaws.com/AWSServiceRoleForEC2Spot"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "createdBy" = "terraform aws-iam/policy"
        }
      + tags_all    = {
          + "createdBy" = "terraform aws-iam/policy"
        }
    }

  # module.databricks_role.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + sts:ExternalId = "7708677754440798"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::414351767826:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "honest-crossaccount"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "createdBy" = "terraform aws-iam/role"
        }
      + tags_all              = {
          + "createdBy" = "terraform aws-iam/role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.databricks_role.aws_iam_role_policy_attachment.test-attach["arn:aws:iam::509042517039:policy/honest-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::509042517039:policy/honest-policy"
      + role       = "honest-crossaccount"
    }

  # module.aws-databricks.module.vpc_endpoints.aws_vpc_endpoint.this["kinesis-streams"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.kinesis-streams"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "random_id",
          + "random_id_2",
        ]
      + tags                  = {
          + "Name" = "honest-kinesis-vpc-endpoint"
        }
      + tags_all              = {
          + "Name" = "honest-kinesis-vpc-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "random_id"

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.aws-databricks.module.vpc_endpoints.aws_vpc_endpoint.this["s3"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "honest-s3-vpc-endpoint"
        }
      + tags_all              = {
          + "Name" = "honest-s3-vpc-endpoint"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "random_id"

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.aws-databricks.module.vpc_endpoints.aws_vpc_endpoint.this["sts"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.sts"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "random_id",
          + "random_id_2",
        ]
      + tags                  = {
          + "Name" = "honest-sts-vpc-endpoint"
        }
      + tags_all              = {
          + "Name" = "honest-sts-vpc-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "random_id"

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 7 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @bludot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Action`*